Autodesk.Revit.DB.UpdaterId.GetAddInId
AddInId of the UpdaterId
Since:
2011

Autodesk.Revit.DB.UpdaterId.GetGUID
GUID value of the UpdaterId
Since:
2011

Autodesk.Revit.DB.UpdaterId.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.UpdaterId.#ctor(Autodesk.Revit.DB.AddInId,System.Guid)
creates an instance of UpdaterId for given AddInId and a given GUID value
addInId:
Id of addin that registers an Updater
val:
a GUID identifying the Updater within addin
Throws Autodesk.Revit.Exceptions.ArgumentException:
addInId is not valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.UpdaterId
A unique identifier of an Updater
Remarks:
UpdaterID used as a key to register and unregister Updaters and UpdateTriggers in Revit application
Since:
2011